
[
	{
		"title": "Constructing a Human Atrial Fibre Atlas",
		"authors": "Roney, Caroline H., Bendikas, Rokas, Pashakhanloo, Farhad, Corrado, Cesare, Vigmond, Edward J., McVeigh, Elliot R., Trayanova, Natalia A., and Niederer, Steven A.",
		"abstract": "Abstract Atrial anisotropy affects electrical propagation patterns, anchor locations of atrial reentrant drivers, and atrial mechanics. However, patient-specific atrial fibre fields and anisotropy measurements are not currently available, and consequently assigning fibre fields to atrial models is challenging. We aimed to construct an atrial fibre atlas from a high-resolution DTMRI dataset that optimally reproduces electrophysiology simulation predictions corresponding to patient-specific fibre fields, and to develop a methodology for automatically assigning fibres to patient-specific anatomies. We extended an atrial coordinate system to map the pulmonary veins, vena cava and appendages to standardised positions in the coordinate system corresponding to the average location across the anatomies. We then expressed each fibre field in this atrial coordinate system and calculated an average fibre field. To assess the effects of fibre field on patient-specific modelling predictions, we calculated paced activation time maps and electrical driver locations during AF. In total, 756 activation time maps were calculated (7 anatomies with 9 fibre maps and 2 pacing locations, for the endocardial, epicardial and bilayer surface models of the LA and RA). Patient-specific fibre fields had a relatively small effect on average paced activation maps (range of mean local activation time difference for LA fields: 2.67–3.60 ms, and for RA fields: 2.29–3.44 ms), but had a larger effect on maximum LAT differences (range for LA 12.7–16.6%; range for RA 11.9–15.0%). A total of 126 phase singularity density maps were calculated (7 anatomies with 9 fibre maps for the LA and RA bilayer models). The fibre field corresponding to anatomy 1 had the highest median PS density map correlation coefficient for LA bilayer simulations (0.44 compared to the other correlations, ranging from 0.14 to 0.39), while the average fibre field had the highest correlation for the RA bilayer simulations (0.61 compared to the other correlations, ranging from 0.37 to 0.56). For sinus rhythm simulations, average activation time is robust to fibre field direction; however, maximum differences can still be significant. Patient specific fibres are more important for arrhythmia simulations, particularly in the left atrium. We propose using the fibre field corresponding to DTMRI dataset 1 for LA simulations, and the average fibre field for RA simulations as these optimally predicted arrhythmia properties.",
		"year": 2021,
		"venue": "Annals of Biomedical Engineering",
		"pdf": "/assets/ConstructingAHumanAtrialFibreAtlas.pdf"
	},
	{
		"title": "In silico Comparison of Left Atrial Ablation Techniques That Target the Anatomical, Structural, and Electrical Substrates of Atrial Fibrillation",
		"authors": "Roney, Caroline H., Beach, Marianne L., Mehta, Arihant M., Sim, Iain, Corrado, Cesare, Bendikas, Rokas, Solis-Lemus, Jose A., Razeghi, Orod, Whitaker, John, O’Neill, Louisa, Plank, Gernot, Vigmond, Edward, Williams, Steven E., O’Neill, Mark D., and Niederer, Steven A.",
		"abstract": "Catheter ablation therapy for persistent atrial fibrillation (AF) typically includes pulmonary vein isolation (PVI) and may include additional ablation lesions that target patient-specific anatomical, electrical or structural features. The aim of this study was to compare ablation techniques across a virtual cohort of AF patients. We constructed 20 paroxysmal and 30 persistent AF patient-specific left atrial bilayer models incorporating fibrotic remodelling from late-gadolinium enhancement (LGE) MRI scans. AF was simulated and post-processed using phase mapping to determine electrical driver locations over 15 s. Six different ablation approaches were tested: (i) PVI alone, modelled as wide-area encirclement of the pulmonary veins; PVI together with: (ii) roof and inferior lines to model posterior wall box isolation; (iii) isolating the largest fibrotic area (identified by LGE-MRI); (iv) isolating all fibrotic areas; (v) isolating the largest driver hotspot region (identified as high simulated phase singularity density); (vi) isolating all driver hotspot regions. Ablation efficacy was assessed to predict optimal ablation therapies for individual patients. We subsequently trained a random forest classifier to predict ablation response using (a) imaging metrics alone, (b) imaging and electrical metrics or (c) imaging, electrical and ablation lesion metrics. The optimal ablation approach resulting in termination, or if not possible atrial tachycardia, varied among the virtual patient cohort: (i) 20% PVI alone, (ii) 6% box ablation, (iii) 2% largest fibrosis area, (iv) 4% all fibrosis areas, (v) 2% largest driver hotspot, (vi) 46% all driver hotspots. 20% of cases remained in AF for all ablation strategies. The addition of patient-specific and ablation pattern specific lesion metrics to the trained random forest classifier improved predictive capability from an accuracy of 0.73 to 0.83. The trained classifier results demonstrate that the surface area of pre-ablation driver regions and of fibrotic tissue not isolated by the proposed ablation strategy are both important for predicting ablation outcome. Overall, our study demonstrates the need to select the optimal ablation strategy for each patient. It suggests that both patient-specific fibrosis properties and driver locations are important for planning ablation approaches, and the distribution of lesions is important for predicting an acute response.",
		"year": 2020,
		"venue": "Frontiers in Physiology",
		"pdf": "/assets/InSilicoComparison.pdf"
	},
	{
		"title": "Constructing Virtual Patient Cohorts for Simulating Atrial Fibrillation Ablation",
		"authors": "Roney, Caroline H, Beach, Marianne, Mehta, Arihant, Sim, Iain, Corrado, Cesare, Bendikas, Rokas, Solis-Lemus, Jose A, Razeghi, Orod, Whitaker, John, O'Neill, Louisa, Plank, Gernot, Vigmond, Edward, Williams, Steven E, O'Neill, Mark D, and Niederer, Steven A",
		"abstract": "Determining the optimal treatment approach for patients with atrial fibrillation (AF) is challenging as patient-specific mechanisms underlying the arrhythmia are typically unknown. Virtual patient cohort simulations can be used to investigate these mechanisms and the effects of atrial anatomy, electrical and structural substrate on potential AF ablation treatment outcomes. It is important that virtual cohort models are constructed using a consistent and reproducible approach regardless of the large variability in atrial morphology between patients. This allows comparison of virtual ablation outcomes between cases. In this study we developed a standardised pipeline for constructing personalised biophysical left atrial models using segmented late-gadolinium enhancement magnetic resonance imaging (LGE-MRI) data. Fibrotic remodelling was incorporated according to the distribution of LGE intensity values as changes in conductivity and ionic cell model properties. We present a methodology for simulating AF: seeding four spiral wave re-entries at standard locations across the anatomies; and for testing different ablation approaches across a large virtual patient cohort of personalised left atrial models. We simulated pulmonary vein isolation (PVI) ablation across a cohort of 20 paroxysmal and 30 persistent AF patient models.",
		"year": 2020,
		"venue": "Computing in Cardiology",
		"pdf": "/assets/ConstructingVirtualPatientCohortsforSimulatingAtrialFibrillationAblation.pdf"
	}
	
]

